#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	// Integer6. Дано двозначне число.
	// Використовувати операцію цілочисельного ділення, для знаходження одиниць - операцію взяття залишку від ділення.
	// Вивести спочатку його ліву цифру (десятки), а потім - його праву цифру(одиниці).
	
	//декларація змінних
	cout << "Integer6." << endl;
	int num;				// змінна для введеного числа
	int tens, ones;			// для десятків і одиниць
	
	// введення данних
	cout << "Enter a two-digit number=";
	cin >> num;
	
	// підрахунок
	tens = num / 10;		// ліве число (десятки)
	ones = num % 10;		// праве число (одиниці)
	
	// виведення результату
	cout << "Tens=" << tens << endl;
	cout << "Ones=" << ones << endl;

	return 0;
}
